Workspace/OpenFOAM-plus-OpenFOAM-v1812/tutorials/incompressible/pimpleFoam/RAS/oscillatingInletPeriodicAMI2D/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

solver          solidBody;

solidBodyCoeffs
{
    cellZone        inletChannel;

    solidBodyMotionFunction oscillatingLinearMotion;

    oscillatingLinearMotionCoeffs
    {
        amplitude       (0 0.5 0);
        omega           3.14; // rad/s  (.5 rps)
    }
}


// ************************************************************************* //
